configuration/src/Catalogs/Филиалы/Филиалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Филиалы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>КастомныеКоманды</name>
      <description>Кастомные команды</description>
    </items>
  </predefined>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаместительРуководителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФилиала</name>
    <type>
      <types>EnumRef.ТипыФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленВИсточнике</name>
    <comment>Устанавливается в Истину, если обменом пришло Удаление объекта.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбщийКаналRocketChat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИерархияТерриторий</name>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Территории</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрабатываемыеСистемы</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/ИзбранныеОбъекты/ИзбранныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранныеОбъекты</name>
  <comment>Хранит объекты, которые пользователь добавил в избранное</comment>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипыИзбранныхОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектИзбранного</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/НастройкиФилиалов/НастройкиФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиФилиалов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ВидыНастроекФилиалов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор последнего изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <comment>Владелец настройки</comment>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ТипыИзбранныхОбъектов/ТипыИзбранныхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзбранныхОбъектов</name>
  <enumValues>
    <name>Пользователи</name>
  </enumValues>
  <enumValues>
    <name>Направления</name>
  </enumValues>
  <enumValues>
    <name>Системы</name>
  </enumValues>
  <enumValues>
    <name>Филиалы</name>
  </enumValues>
  <enumValues>
    <name>ГруппыЗаказчиков</name>
  </enumValues>
  <enumValues>
    <name>Продукты</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/ТипыФилиалов/ТипыФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФилиалов</name>
  <enumValues>
    <name>IT</name>
  </enumValues>
  <enumValues>
    <name>НеIT</name>
  </enumValues>
  <enumValues>
    <name>QA</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/НаправленияРазработки/НаправленияРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаправленияРазработки</name>
  <attributes>
    <name>ИспользоватьВидыПроцессов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГабаритноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказчики</name>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Руководитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЮридическиеЛица</name>
    <attributes>
      <name>ЮридическоеЛицо</name>
      <type>
        <types>CatalogRef.ЮридическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/ChartsOfCharacteristicTypes/ВидыНастроекФилиалов/ВидыНастроекФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыНастроекФилиалов</name>
  <type>
    <types>CatalogRef.Филиалы</types>
    <types>CatalogRef.ЮридическиеЛица</types>
    <types>CatalogRef.ВидыЗадач</types>
    <types>Boolean</types>
    <types>CatalogRef.НаправленияРазработки</types>
    <types>CatalogRef.Процессы</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.СистемыУчета</types>
    <types>CatalogRef.НазначенияЗадач</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КонтрольКачества</name>
      <description>Настройки тестирования</description>
      <code>000000028</code>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Основное</name>
      <description>Основное</description>
      <code>000000053</code>
    </items>
    <items>
      <name>ПроцессРазработки</name>
      <description>Процесс разработки</description>
      <code>000000006</code>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
      <code>000000004</code>
    </items>
    <items>
      <name>СотрудникиФилиала</name>
      <description>Сотрудники филиала</description>
      <code>000000047</code>
    </items>
    <items>
      <name>Трудозатраты</name>
      <description>Трудозатраты</description>
      <code>000000001</code>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ВариантГруппировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйРеквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСписокВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКакПодраздел</name>
    <comment>Истина - будет группа будет представлена подразделом. Ложь - будетотображена как группа с заголовком на родительской странице</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <comment>Текст подсказки, которая будет отображаться в виде контекстной подсказки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСледования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПерезапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВыбора</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ВидыНастроекФилиалов</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыФилиалов</name>
    <attributes>
      <name>ТипФилиала</name>
      <type>
        <types>EnumRef.ТипыФилиалов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/Catalogs/Филиалы/Forms/МножественныйВыбор/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
// Описание назначения параметров формы:
//  - ВыбранныеФилиалы - список значений - элементы справочника Филиалы
//  - ITСтруктура      - булево          - если Истина выбирать только филиалы IT
//  - ВключаяКоманды   - булево          - если Истина дополнительно выводить команды филиалов.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка общего условного оформления для окон данного вида
	ИнтерфейсПриложения.УстановитьУсловноеОформлениеСпискаДоступныхЗначений(
		ЭтотОбъект, "ДоступныеФилиалы.Избранное", "ДоступныеФилиалыПредставлениеДоступные");
		
	УстановитьЗаголовкиЭлементов();		
	ЗаполнитьСпискиФилиалов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтрокаПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	// Установка отбора на основании значения в строке поиска
	ИнтерфейсПриложенияКлиент.УстановитьОтборПриИзмененииСтрокиПоиска(
		ЭтотОбъект, "ДоступныеФилиалы", Текст, "Наименование");
		
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	ИнтерфейсПриложенияКлиент.СброситьПоиск(ЭтотОбъект, "ДоступныеФилиалы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий таблицы "ВыбранныеФилиалы"

&НаКлиенте
Процедура ВыбранныеФилиалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВыбранныеФилиалыИсключить" Тогда
		НайденнаяСтрока = ВыбранныеФилиалы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		НайденнаяСтрока = ДоступныеФилиалы.НайтиПоИдентификатору(НайденнаяСтрока.ИдентификаторСтрокиСписка);
		
		ИсключитьФилиал(НайденнаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий таблицы "ДоступныеФилиалы"

&НаКлиенте
Процедура ДоступныеФилиалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	НайденнаяСтрока = ДоступныеФилиалы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ДоступныеФилиалыПредставление" Тогда
		НайденнаяСтрока.Пометка = НЕ НайденнаяСтрока.Пометка;
		
		ОбработатьИзменениеСтрокиДоступныхФилиалов(НайденнаяСтрока);
		
	ИначеЕсли Поле.Имя = "ДоступныеФилиалыИзбранное" Тогда
		Избранное = НайденнаяСтрока.Избранное;
		
		ПараметрыОтбора = Новый Структура("Родитель", НайденнаяСтрока.Филиал);
		НайденныеСтроки = ДоступныеФилиалы.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.Избранное = НЕ Избранное;
		КонецЦикла;
		
		ОбщегоНазначенияВызовСервера.ОбработатьПометкуИзбранного(НайденнаяСтрока.Филиал, НайденнаяСтрока.Избранное, "Филиалы");
		
		ДоступныеФилиалы.Сортировать("Избранное УБЫВ, РодительПредставление, ПриоритетСортировки, Наименование");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеФилиалыПометкаПриИзменении(Элемент)
	
	ОбработатьИзменениеСтрокиДоступныхФилиалов(Элементы.ДоступныеФилиалы.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)
		
	ВозвращаемыеФилиалы = Новый СписокЗначений;
	
	Если ВыбранныеФилиалы.Количество() > 0 Тогда
		Для Каждого СтрокаТаблицы Из ВыбранныеФилиалы Цикл
			ВозвращаемыеФилиалы.Добавить(СтрокаТаблицы.Филиал, СтрокаТаблицы.Наименование);
		КонецЦикла;		
	КонецЕсли;	
	
	Закрыть(ВозвращаемыеФилиалы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометкуДоступных(Команда)
	
	Пометка = (Команда.Имя = "ОтметитьВсе");
	
	Для Каждого Строка Из ДоступныеФилиалы Цикл
		Если Строка.Пометка <> Пометка Тогда
			Если Пометка Тогда
				ДобавитьФилиал(Строка);
			Иначе
				ИсключитьФилиал(Строка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьИзбранные(Команда)
	
	Для Каждого Строка Из ДоступныеФилиалы Цикл
		Если Строка.Избранное Тогда
			Если НЕ Строка.Пометка Тогда
				ДобавитьФилиал(Строка);
			КонецЕсли;
		Иначе
			Если Строка.Пометка Тогда
				ИсключитьФилиал(Строка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	
	ИнтерфейсПриложенияКлиент.СброситьПоиск(ЭтотОбъект, "ДоступныеФилиалы");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьФилиал(СтрокаТаблицы)
	
	НоваяСтрокаВыбранных = ВыбранныеФилиалы.Добавить();
	НоваяСтрокаВыбранных.Исключить = БиблиотекаКартинок.УдалитьЗначение;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрокаВыбранных, СтрокаТаблицы);
	
	СтрокаТаблицы.Пометка = Истина;
	
	СтрокаТаблицы.ИдентификаторСтрокиСписка = НоваяСтрокаВыбранных.ПолучитьИдентификатор();
	НоваяСтрокаВыбранных.ИдентификаторСтрокиСписка = СтрокаТаблицы.ПолучитьИдентификатор();
	
	ВыбранныеФилиалы.Сортировать("РодительПредставление, ПриоритетСортировки, Наименование");
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьФилиал(СтрокаТаблицы)
	
	НайденнаяСтрока = ВыбранныеФилиалы.НайтиПоИдентификатору(СтрокаТаблицы.ИдентификаторСтрокиСписка);
	
	Если НайденнаяСтрока <> Неопределено Тогда
		ВыбранныеФилиалы.Удалить(НайденнаяСтрока);
	КонецЕсли;	
	
	СтрокаТаблицы.Пометка = Ложь;
	СтрокаТаблицы.ИдентификаторСтрокиСписка = -1;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиФилиалов()
	
	ВыбранныеФилиалы.Очистить();
	ДоступныеФилиалы.Очистить();
	
	Если Параметры.Свойство("ВключаяКоманды") И Параметры.ВключаяКоманды Тогда
		ТекстЗапроса =
		#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ИзбранныеОбъекты.Объект КАК Справочник.Филиалы) КАК Филиал
		|ПОМЕСТИТЬ ИзбранныеФилиалы
		|ИЗ
		|	РегистрСведений.ИзбранныеОбъекты КАК ИзбранныеОбъекты
		|ГДЕ
		|	ИзбранныеОбъекты.Владелец = &ТекущийПользователь
		|	И ИзбранныеОбъекты.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.ТипыИзбранныхОбъектов.Филиалы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Филиалы.Ссылка КАК Ссылка,
		|	Филиалы.Наименование КАК Наименование,
		|	Филиалы.Наименование КАК ПредставлениеДоступные,
		|	Филиалы.Наименование КАК ПредставлениеВыбранные,
		|	Филиалы.Ссылка КАК Родитель,
		|	0 КАК ПриоритетСортировки,
		|	ВЫБОР
		|		КОГДА ИзбранныеФилиалы.Филиал ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Избранное
		|ПОМЕСТИТЬ Филиалы
		|ИЗ
		|	Справочник.Филиалы КАК Филиалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИзбранныеФилиалы КАК ИзбранныеФилиалы
		|		ПО Филиалы.Ссылка = ИзбранныеФилиалы.Филиал
		|ГДЕ
		|	НЕ Филиалы.ПометкаУдаления
		|{ГДЕ
		|	Филиалы.ТипФилиала КАК ТипФилиала,
		|	Филиалы.Ссылка КАК Филиал}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Филиалы.Ссылка КАК Ссылка,
		|	Филиалы.Наименование КАК Наименование,
		|	Филиалы.ПредставлениеДоступные КАК ПредставлениеДоступные,
		|	Филиалы.ПредставлениеВыбранные КАК ПредставлениеВыбранные,
		|	Филиалы.Родитель КАК Родитель,
		|	0 КАК ПриоритетСортировки,
		|	Филиалы.Избранное КАК Избранное
		|ПОМЕСТИТЬ ФилиалыИКоманды
		|ИЗ
		|	Филиалы КАК Филиалы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Команды.Ссылка,
		|	Команды.Наименование,
		|	"" -  команда "" + Команды.Наименование,
		|	""команда "" + Команды.Наименование,
		|	Команды.Родитель,
		|	1,
		|	Филиалы.Избранное
		|ИЗ
		|	Филиалы КАК Филиалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Филиалы КАК Команды
		|		ПО Филиалы.Ссылка = Команды.Родитель
		|			И (Филиалы.Ссылка <> ЗНАЧЕНИЕ(Справочник.Филиалы.КастомныеКоманды))
		|			И (НЕ Команды.ПометкаУдаления)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Команды.Ссылка,
		|	Команды.Наименование,
		|	"" -  команда "" + Команды.Наименование,
		|	""команда "" + Команды.Наименование,
		|	Команды.Родитель,
		|	1,
		|	Филиалы.Избранное
		|ИЗ
		|	Филиалы КАК Филиалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Филиалы КАК Команды
		|		ПО Филиалы.Ссылка = Команды.Родитель
		|			И (Филиалы.Ссылка = ЗНАЧЕНИЕ(Справочник.Филиалы.КастомныеКоманды))
		|			И (НЕ Команды.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ФилиалыИКоманды.Ссылка В (&ВыбранныеФилиалы)
		|				И ФилиалыИКоманды.Ссылка <> ЗНАЧЕНИЕ(Справочник.Филиалы.КастомныеКоманды)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Пометка,
		|	ФилиалыИКоманды.Избранное КАК Избранное,
		|	ФилиалыИКоманды.Ссылка КАК Филиал,
		|	ФилиалыИКоманды.Наименование КАК Наименование,
		|	ФилиалыИКоманды.ПредставлениеДоступные КАК ПредставлениеДоступные,
		|	ФилиалыИКоманды.ПредставлениеВыбранные КАК ПредставлениеВыбранные,
		|	ФилиалыИКоманды.Родитель КАК Родитель,
		|	Филиалы.Наименование КАК РодительПредставление,
		|	ФилиалыИКоманды.ПриоритетСортировки КАК ПриоритетСортировки,
		|	-1 КАК ИдентификаторСтрокиСписка
		|ИЗ
		|	ФилиалыИКоманды КАК ФилиалыИКоманды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Филиалы КАК Филиалы
		|		ПО ФилиалыИКоманды.Родитель = Филиалы.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Избранное УБЫВ,
		|	РодительПредставление,
		|	ПриоритетСортировки,
		|	Наименование";
		#КонецОбласти
	Иначе
		ТекстЗапроса =
		#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ИзбранныеОбъекты.Объект КАК Справочник.Филиалы) КАК Филиал
		|ПОМЕСТИТЬ ИзбранныеФилиалы
		|ИЗ
		|	РегистрСведений.ИзбранныеОбъекты КАК ИзбранныеОбъекты
		|ГДЕ
		|	ИзбранныеОбъекты.Владелец = &ТекущийПользователь
		|	И ИзбранныеОбъекты.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.ТипыИзбранныхОбъектов.Филиалы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Филиалы.Ссылка В (&ВыбранныеФилиалы)
		|				И Филиалы.Ссылка <> ЗНАЧЕНИЕ(Справочник.Филиалы.КастомныеКоманды)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ИзбранныеФилиалы.Филиал ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Избранное,
		|	Филиалы.Ссылка КАК Филиал,
		|	Филиалы.Наименование КАК Наименование,
		|	Филиалы.Наименование КАК ПредставлениеДоступные,
		|	Филиалы.Наименование КАК ПредставлениеВыбранные,
		|	Филиалы.Ссылка КАК Родитель,
		|	-1 КАК ИдентификаторСтрокиСписка
		|ИЗ
		|	Справочник.Филиалы КАК Филиалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФилиалов КАК НастройкиФилиалов
		|		ПО Филиалы.Ссылка = НастройкиФилиалов.Филиал
		|			И (НастройкиФилиалов.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекФилиалов.НаправлениеРазработки))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
		|		ПО Филиалы.ЮридическоеЛицо = ЮридическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИзбранныеФилиалы КАК ИзбранныеФилиалы
		|		ПО Филиалы.Ссылка = ИзбранныеФилиалы.Филиал
		|ГДЕ
		|	НЕ Филиалы.ПометкаУдаления
		|	И (ВЫРАЗИТЬ(ЕСТЬNULL(НастройкиФилиалов.Значение, ЗНАЧЕНИЕ(Справочник.НаправленияРазработки.ПустаяСсылка)) КАК Справочник.НаправленияРазработки)) <> ЗНАЧЕНИЕ(Справочник.НаправленияРазработки.ПустаяСсылка)
		|{ГДЕ
		|	Филиалы.ТипФилиала КАК ТипФилиала,
		|	Филиалы.Ссылка КАК Филиал,
		|	ЕСТЬNULL(ЮридическиеЛица.ЯвляетсяИТОрганизацией, ЛОЖЬ) КАК ТолькоИТФилиалы,
		|	НастройкиФилиалов.Значение КАК Направление}
		|
		|УПОРЯДОЧИТЬ ПО
		|	Избранное УБЫВ,
		|	Наименование";
		#КонецОбласти
	КонецЕсли;
		             
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст = ТекстЗапроса;
	ПостроительЗапроса.Параметры.Вставить("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	ПостроительЗапроса.Параметры.Вставить("ВыбранныеФилиалы", Параметры.ВыбранныеФилиалы);
		
	Если Параметры.Свойство("ITСтруктура") Тогда
		ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("ТипФилиала");
		ЭлементОтбора.ВидСравнения = ?(Параметры.ITСтруктура, ВидСравнения.НеРавно, ВидСравнения.Равно);
		ЭлементОтбора.Значение = Перечисления.ТипыФилиалов.НеIT;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Направление") Тогда
		ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("Направление");
		ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
		ЭлементОтбора.Значение = Параметры.Направление;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоИТФилиалы") Тогда
		ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("ТолькоИТФилиалы");
		ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
		ЭлементОтбора.Значение = Параметры.ТолькоИТФилиалы;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ФилиалыНаправления") Тогда
		СписокФилиалов = Новый СписокЗначений;
		СписокФилиалов.ЗагрузитьЗначения(Параметры.ФилиалыНаправления);
		
		ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("Филиал");
		ЭлементОтбора.ВидСравнения = ВидСравнения.ВСписке;
		ЭлементОтбора.Значение = СписокФилиалов;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();	
	РезультатЗапроса = ПостроительЗапроса.Результат;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			// Заполнение общей таблицы филиалов
			НоваяСтрокаДоступных = ДоступныеФилиалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДоступных, Выборка);
			
			// Заполнение таблицы уже выбранных филиалов
			Если Выборка.Пометка Тогда 				
				НоваяСтрокаВыбранных = ВыбранныеФилиалы.Добавить();
				НоваяСтрокаВыбранных.Исключить = БиблиотекаКартинок.УдалитьЗначение;
				
				НоваяСтрокаВыбранных.ИдентификаторСтрокиСписка = НоваяСтрокаДоступных.ПолучитьИдентификатор();
				НоваяСтрокаДоступных.ИдентификаторСтрокиСписка = НоваяСтрокаВыбранных.ПолучитьИдентификатор();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВыбранных, Выборка, , "ИдентификаторСтрокиСписка");
			КонецЕсли;
		КонецЦикла;
		
		ВыбранныеФилиалы.Сортировать("РодительПредставление, ПриоритетСортировки, Наименование");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСтрокиДоступныхФилиалов(СтрокаТаблицы)
	
	Если СтрокаТаблицы.Пометка = Истина Тогда
		ДобавитьФилиал(СтрокаТаблицы);	
	Иначе
		ИсключитьФилиал(СтрокаТаблицы);	
	КонецЕсли;			
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиЭлементов()
	
	Если Параметры.Свойство("ВключаяКоманды") И Параметры.ВключаяКоманды Тогда
		Заголовок = Заголовок + " и команд";
		Элементы.НадписьДобавитьФилиалы.Заголовок = Элементы.НадписьДобавитьФилиалы.Заголовок + " и команды";
		Элементы.НадписьВыбранныеФилиалы.Заголовок = Элементы.НадписьВыбранныеФилиалы.Заголовок + " и команды";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
